app/views/climbers/edit.html.erb

SELECT "mountains".* FROM "mountains"
---
    <br>
    Mountain: <%= c.collection_select :mountain_id, Mountain.all, :id, :name %>