app/views/climbers/new.html.erb

    <br>
    Mountain: <%= c.collection_select :mountain_id, Mountain.all, :id, :name %>
---
SELECT "mountains".* FROM "mountains"