app/views/mountains/show.html.erb

    <ul>
        <% @mountain.climbers.each do |c| %>
---
SELECT "climbers".* FROM "climbers" WHERE "climbers"."mountain_id" = ?  [["mountain_id", 1]]