app/controllers/climbers_controller.rb

SELECT "climbers".* FROM "climbers"
---
    def index
        @climbers = Climber.all

INSERT INTO "climbers" ("name", "age", "country", "mountain_id") VALUES (?, ?, ?, ?)  [["name", "Ekow"], ["age", 32], ["country", "USA"], ["mountain_id", 2]]
---
    def create
        @climber = Climber.create(climber_params)

SELECT  "climbers".* FROM "climbers" WHERE "climbers"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
    def show
        @climber = Climber.find(params[:id])

SELECT  "climbers".* FROM "climbers" WHERE "climbers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def edit
        @climber = Climber.find(params[:id])

SELECT  "climbers".* FROM "climbers" WHERE "climbers"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
UPDATE "climbers" SET "name" = ? WHERE "climbers"."id" = ?  [["name", "Prince1"], ["id", 7]]
---
    def update
        @climber = Climber.find(params[:id])
        @climber.update(climber_params)