app/controllers/mountains_controller.rb

SELECT  "mountains".* FROM "mountains" WHERE "mountains"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        @mountain = Mountain.find(params[:id])